# Lab 6

In [2]:
import pandas as pd

In [5]:
# 1. Download the file 'mydata.csv' from Canvas. Load it into a DataFrame named mydata.
mydata = pd.read_csv('mydata.csv')
print(mydata)

       Name         Breed  Weight   Age
0      Fido          Mutt    15.0  15.0
1      odie  Irish_Setter    50.0   2.0
2    Snoopy        Beagle    18.0   2.0
3     Barfy          Mutt    20.0   8.0
4      Spot     Dalmatian    25.0  12.0
5      hugo       Terrier     NaN  10.0
6    Lassie        Collie    30.0  75.0
7     Mangy           NaN    40.0  10.0
8     Larry        Basset    25.0   4.0
9     Daryl     Retriever    42.0   8.0
10   Darrel     Chihuahua     9.0  48.0
11   Hotdog     Dachshund     NaN   NaN
12      NaN           Lab     NaN   NaN
13    Harpo      Airedale   200.0   9.0
14    Zeppo     Pekingese    32.0   NaN
15  Groucho       Whippet    49.0   7.0
16      Bob        yorkie     NaN   1.0
17     Thor    Great Dane   105.0   6.0
18    Brian         Akita     NaN  12.0
19   Farkas         Boxer    52.0   9.0
       Name         Breed  Weight   Age
0      Fido          Mutt    15.0  15.0
1      odie  Irish_Setter    50.0   2.0
2    Snoopy        Beagle    18.0   2.0
3     Barfy          Mutt    20.0   8.0
4      Spot     Dalmatian    25.0  12.0
6    Lassie        Collie    30.0  75.0
8     Larry        Basset    25.0   4.0
9     Daryl     Retriever    42.0   8.0
10   Darrel     Chihuahua     9.0  48.0
13    Harpo      Airedale   200.0   9.0
15  Groucho       Whippet    49.0   7.0
17     Thor    Great Dane   105.0   6.0
19   Farkas         Boxer    52.0   9.0

In [6]:
# 2. Create t1 as just the entries of mydata that don't contain NaN values.
t1 = mydata.dropna()
print(t1)

       Name         Breed  Weight   Age
0      Fido          Mutt    15.0  15.0
1      odie  Irish_Setter    50.0   2.0
2    Snoopy        Beagle    18.0   2.0
3     Barfy          Mutt    20.0   8.0
4      Spot     Dalmatian    25.0  12.0
6    Lassie        Collie    30.0  75.0
8     Larry        Basset    25.0   4.0
9     Daryl     Retriever    42.0   8.0
10   Darrel     Chihuahua     9.0  48.0
13    Harpo      Airedale   200.0   9.0
15  Groucho       Whippet    49.0   7.0
17     Thor    Great Dane   105.0   6.0
19   Farkas         Boxer    52.0   9.0

In [7]:
# 3. Compute the average weight and the average age from t1.
avg_weight = t1['Weight'].mean()
ave_age = t1['Age'].mean()
print(avg_weight)
print(ave_age)

49.23076923076923
15.76923076923077

In [8]:
#4. Create t2 from mydata with the NaN fields in the Weight column replaced by the average weight. 
t2 = mydata.fillna({'Weight':avg_weight})
print(t2)

       Name         Breed      Weight   Age
0      Fido          Mutt   15.000000  15.0
1      odie  Irish_Setter   50.000000   2.0
2    Snoopy        Beagle   18.000000   2.0
3     Barfy          Mutt   20.000000   8.0
4      Spot     Dalmatian   25.000000  12.0
5      hugo       Terrier   49.230769  10.0
6    Lassie        Collie   30.000000  75.0
7     Mangy           NaN   40.000000  10.0
8     Larry        Basset   25.000000   4.0
9     Daryl     Retriever   42.000000   8.0
10   Darrel     Chihuahua    9.000000  48.0
11   Hotdog     Dachshund   49.230769   NaN
12      NaN           Lab   49.230769   NaN
13    Harpo      Airedale  200.000000   9.0
14    Zeppo     Pekingese   32.000000   NaN
15  Groucho       Whippet   49.000000   7.0
16      Bob        yorkie   49.230769   1.0
17     Thor    Great Dane  105.000000   6.0
18    Brian         Akita   49.230769  12.0
19   Farkas         Boxer   52.000000   9.0

In [9]:
#5. Create t3 from mydata with the NaN fields in the Age column replaced by the average age.
t3 = mydata.fillna({'Age':ave_age})
print(t3)

       Name         Breed  Weight        Age
0      Fido          Mutt    15.0  15.000000
1      odie  Irish_Setter    50.0   2.000000
2    Snoopy        Beagle    18.0   2.000000
3     Barfy          Mutt    20.0   8.000000
4      Spot     Dalmatian    25.0  12.000000
5      hugo       Terrier     NaN  10.000000
6    Lassie        Collie    30.0  75.000000
7     Mangy           NaN    40.0  10.000000
8     Larry        Basset    25.0   4.000000
9     Daryl     Retriever    42.0   8.000000
10   Darrel     Chihuahua     9.0  48.000000
11   Hotdog     Dachshund     NaN  15.769231
12      NaN           Lab     NaN  15.769231
13    Harpo      Airedale   200.0   9.000000
14    Zeppo     Pekingese    32.0  15.769231
15  Groucho       Whippet    49.0   7.000000
16      Bob        yorkie     NaN   1.000000
17     Thor    Great Dane   105.0   6.000000
18    Brian         Akita     NaN  12.000000
19   Farkas         Boxer    52.0   9.000000

In [10]:
# 6. Create t4 from t2 by doing #5 to replace missing Age values with the average age.
t4 = t2.fillna({'Age':ave_age})
print(t4)

       Name         Breed      Weight        Age
0      Fido          Mutt   15.000000  15.000000
1      odie  Irish_Setter   50.000000   2.000000
2    Snoopy        Beagle   18.000000   2.000000
3     Barfy          Mutt   20.000000   8.000000
4      Spot     Dalmatian   25.000000  12.000000
5      hugo       Terrier   49.230769  10.000000
6    Lassie        Collie   30.000000  75.000000
7     Mangy           NaN   40.000000  10.000000
8     Larry        Basset   25.000000   4.000000
9     Daryl     Retriever   42.000000   8.000000
10   Darrel     Chihuahua    9.000000  48.000000
11   Hotdog     Dachshund   49.230769  15.769231
12      NaN           Lab   49.230769  15.769231
13    Harpo      Airedale  200.000000   9.000000
14    Zeppo     Pekingese   32.000000  15.769231
15  Groucho       Whippet   49.000000   7.000000
16      Bob        yorkie   49.230769   1.000000
17     Thor    Great Dane  105.000000   6.000000
18    Brian         Akita   49.230769  12.000000
19   Farkas         Boxer   52.000000   9.000000

In [11]:
# 7. Create t5 from mydata by forward-filling missing data.
t5 = mydata.fillna(method='ffill')
print(t5)

       Name         Breed  Weight   Age
0      Fido          Mutt    15.0  15.0
1      odie  Irish_Setter    50.0   2.0
2    Snoopy        Beagle    18.0   2.0
3     Barfy          Mutt    20.0   8.0
4      Spot     Dalmatian    25.0  12.0
5      hugo       Terrier    25.0  10.0
6    Lassie        Collie    30.0  75.0
7     Mangy        Collie    40.0  10.0
8     Larry        Basset    25.0   4.0
9     Daryl     Retriever    42.0   8.0
10   Darrel     Chihuahua     9.0  48.0
11   Hotdog     Dachshund     9.0  48.0
12   Hotdog           Lab     9.0  48.0
13    Harpo      Airedale   200.0   9.0
14    Zeppo     Pekingese    32.0   9.0
15  Groucho       Whippet    49.0   7.0
16      Bob        yorkie    49.0   1.0
17     Thor    Great Dane   105.0   6.0
18    Brian         Akita   105.0  12.0
19   Farkas         Boxer    52.0   9.0

In [12]:
# 8. Create t6 as a copy t4. Then replace any Age values larger than 18 with the average age.
t6 = t4.copy()
t6.loc[t6['Age'] > 18, 'Age'] = ave_age
print(t6)

       Name         Breed      Weight        Age
0      Fido          Mutt   15.000000  15.000000
1      odie  Irish_Setter   50.000000   2.000000
2    Snoopy        Beagle   18.000000   2.000000
3     Barfy          Mutt   20.000000   8.000000
4      Spot     Dalmatian   25.000000  12.000000
5      hugo       Terrier   49.230769  10.000000
6    Lassie        Collie   30.000000  15.769231
7     Mangy           NaN   40.000000  10.000000
8     Larry        Basset   25.000000   4.000000
9     Daryl     Retriever   42.000000   8.000000
10   Darrel     Chihuahua    9.000000  15.769231
11   Hotdog     Dachshund   49.230769  15.769231
12      NaN           Lab   49.230769  15.769231
13    Harpo      Airedale  200.000000   9.000000
14    Zeppo     Pekingese   32.000000  15.769231
15  Groucho       Whippet   49.000000   7.000000
16      Bob        yorkie   49.230769   1.000000
17     Thor    Great Dane  105.000000   6.000000
18    Brian         Akita   49.230769  12.000000
19   Farkas         Boxer   52.000000   9.000000

In [13]:
# 9. Create t7 as a copy of t6. Then replace any Weight values larger than 150 with the average weight.
t7 = t6.copy()
t7.loc[t7['Weight'] > 150, 'Weight'] = avg_weight
print(t7)

       Name         Breed      Weight        Age
0      Fido          Mutt   15.000000  15.000000
1      odie  Irish_Setter   50.000000   2.000000
2    Snoopy        Beagle   18.000000   2.000000
3     Barfy          Mutt   20.000000   8.000000
4      Spot     Dalmatian   25.000000  12.000000
5      hugo       Terrier   49.230769  10.000000
6    Lassie        Collie   30.000000  15.769231
7     Mangy           NaN   40.000000  10.000000
8     Larry        Basset   25.000000   4.000000
9     Daryl     Retriever   42.000000   8.000000
10   Darrel     Chihuahua    9.000000  15.769231
11   Hotdog     Dachshund   49.230769  15.769231
12      NaN           Lab   49.230769  15.769231
13    Harpo      Airedale   49.230769   9.000000
14    Zeppo     Pekingese   32.000000  15.769231
15  Groucho       Whippet   49.000000   7.000000
16      Bob        yorkie   49.230769   1.000000
17     Thor    Great Dane  105.000000   6.000000
18    Brian         Akita   49.230769  12.000000
19   Farkas         Boxer   52.000000   9.000000

In [14]:
# 10. Create t8 from t7, changing its Age data to int (use astype() )
t8 = t7.astype({'Age':int})
print(t8)

       Name         Breed      Weight  Age
0      Fido          Mutt   15.000000   15
1      odie  Irish_Setter   50.000000    2
2    Snoopy        Beagle   18.000000    2
3     Barfy          Mutt   20.000000    8
4      Spot     Dalmatian   25.000000   12
5      hugo       Terrier   49.230769   10
6    Lassie        Collie   30.000000   15
7     Mangy           NaN   40.000000   10
8     Larry        Basset   25.000000    4
9     Daryl     Retriever   42.000000    8
10   Darrel     Chihuahua    9.000000   15
11   Hotdog     Dachshund   49.230769   15
12      NaN           Lab   49.230769   15
13    Harpo      Airedale   49.230769    9
14    Zeppo     Pekingese   32.000000   15
15  Groucho       Whippet   49.000000    7
16      Bob        yorkie   49.230769    1
17     Thor    Great Dane  105.000000    6
18    Brian         Akita   49.230769   12
19   Farkas         Boxer   52.000000    9

In [15]:
#11. Create t9 from t8, changing any missing Name data to 'Barfy' using fillna( ). 
# Then use apply( ) to change the name column to upper case. Then change the Name column to 'Search Name'
t9 = t8.fillna({'Name':'Barfy'})
t9['Name'] = t9['Name'].apply(lambda x: x.upper())
t9 = t9.rename(columns={'Name':'Search Name'})
print(t9)

   Search Name         Breed      Weight  Age
0         FIDO          Mutt   15.000000   15
1         ODIE  Irish_Setter   50.000000    2
2       SNOOPY        Beagle   18.000000    2
3        BARFY          Mutt   20.000000    8
4         SPOT     Dalmatian   25.000000   12
5         HUGO       Terrier   49.230769   10
6       LASSIE        Collie   30.000000   15
7        MANGY           NaN   40.000000   10
8        LARRY        Basset   25.000000    4
9        DARYL     Retriever   42.000000    8
10      DARREL     Chihuahua    9.000000   15
11      HOTDOG     Dachshund   49.230769   15
12       BARFY           Lab   49.230769   15
13       HARPO      Airedale   49.230769    9
14       ZEPPO     Pekingese   32.000000   15
15     GROUCHO       Whippet   49.000000    7
16         BOB        yorkie   49.230769    1
17        THOR    Great Dane  105.000000    6
18       BRIAN         Akita   49.230769   12
19      FARKAS         Boxer   52.000000    9

In [16]:
#12. Create t10 from t9 using pd.concat( ) and axis = 1, concatenating t9's Search Name column with all of t8.
t10 = pd.concat([t9['Search Name'], t8], axis=1)
print(t10)

   Search Name     Name         Breed      Weight  Age
0         FIDO     Fido          Mutt   15.000000   15
1         ODIE     odie  Irish_Setter   50.000000    2
2       SNOOPY   Snoopy        Beagle   18.000000    2
3        BARFY    Barfy          Mutt   20.000000    8
4         SPOT     Spot     Dalmatian   25.000000   12
5         HUGO     hugo       Terrier   49.230769   10
6       LASSIE   Lassie        Collie   30.000000   15
7        MANGY    Mangy           NaN   40.000000   10
8        LARRY    Larry        Basset   25.000000    4
9        DARYL    Daryl     Retriever   42.000000    8
10      DARREL   Darrel     Chihuahua    9.000000   15
11      HOTDOG   Hotdog     Dachshund   49.230769   15
12       BARFY      NaN           Lab   49.230769   15
13       HARPO    Harpo      Airedale   49.230769    9
14       ZEPPO    Zeppo     Pekingese   32.000000   15
15     GROUCHO  Groucho       Whippet   49.000000    7
16         BOB      Bob        yorkie   49.230769    1
17        THOR     Thor    Great Dane  105.000000    6
18       BRIAN    Brian         Akita   49.230769   12
19      FARKAS   Farkas         Boxer   52.000000    9

# Lab 7

In [26]:
import sqlite3  as sql

In [50]:
# problem 1 
connection = sql.connect('dogsdb.sqlite3')
cursor = connection.cursor()
query='select name from sqlite_master where type="table"' 
cursor.execute(query)
table = cursor.fetchall()
print(table)

[('dogs',)]

In [29]:
# problem 2

#Create a query string to get all the data from dogs. 
# Execute the query into 'cursor', use it to get all the data into a variable named table, 
# and display table and its type. Then loop over table and display its rows.

query = 'select * from dogs'
cursor.execute(query)
table = cursor.fetchall()
print(table)
print(type(table))
for row in table:
    print(row)

[('Fido', 'Mutt', 15, 15), ('Odie', 'Irish_Setter', 50, 2), ('Snoopy', 'Beagle', 18, 2), ('Barfy', 'Mutt', 20, 8), ('Spot', 'Dalmatian', 25, 12), ('Hugo', 'Terrier', 28, 10), ('Lassie', 'Collie', 30, 15), ('Mangy', 'Mutt', 40, 10), ('Larry', 'Basset', 25, 4), ('Daryl', 'Retriever', 42, 8), ('Darrel', 'Chihuahua', 9, 48), ('Hotdog', 'Dachshund', 14, 14), ('Snert', 'Lab', 40, 4), ('Harpo', 'Airedale', 200, 9), ('Zeppo', 'Pekingese', 32, 5), ('Groucho', 'Whippet', 49, 7), ('Bob', 'Yorkie', 8, 1), ('Thor', 'Great Dane', 105, 6), ('Brian', 'Akita', 65, 12), ('Farkas', 'Boxer', 52, 9)]
<class 'list'>
('Fido', 'Mutt', 15, 15)
('Odie', 'Irish_Setter', 50, 2)
('Snoopy', 'Beagle', 18, 2)
('Barfy', 'Mutt', 20, 8)
('Spot', 'Dalmatian', 25, 12)
('Hugo', 'Terrier', 28, 10)
('Lassie', 'Collie', 30, 15)
('Mangy', 'Mutt', 40, 10)
('Larry', 'Basset', 25, 4)
('Daryl', 'Retriever', 42, 8)
('Darrel', 'Chihuahua', 9, 48)
('Hotdog', 'Dachshund', 14, 14)
('Snert', 'Lab', 40, 4)
('Harpo', 'Airedale', 200, 9)
('Zeppo', 'Pekingese', 32, 5)
('Groucho', 'Whippet', 49, 7)
('Bob', 'Yorkie', 8, 1)
('Thor', 'Great Dane', 105, 6)
('Brian', 'Akita', 65, 12)
('Farkas', 'Boxer', 52, 9)

In [32]:
#3. Display cursor.description. 
# Iterate over it to show just the column names (position 0). 
# Create an empty list named colnames. 
# Then do the iteration again and append those names to colnames. 
# Display colnames; it should be a list of the str names of the columns of dogsdb.sqlite3.

print(cursor.description)
for row in cursor.description:
    print(row[0])

colnames = []
for row in cursor.description:
    colnames.append(row[0])

print(colnames)

(('Name', None, None, None, None, None, None), ('Breed', None, None, None, None, None, None), ('Weight', None, None, None, None, None, None), ('Age', None, None, None, None, None, None))
Name
Breed
Weight
Age
['Name', 'Breed', 'Weight', 'Age']

In [33]:
#4. Create a pandas DataFrame named dogsDF with table as the data and colnames as the columns. Display it.
dogsDF = pd.DataFrame(table, columns=colnames)
print(dogsDF)

       Name         Breed  Weight  Age
0      Fido          Mutt      15   15
1      Odie  Irish_Setter      50    2
2    Snoopy        Beagle      18    2
3     Barfy          Mutt      20    8
4      Spot     Dalmatian      25   12
5      Hugo       Terrier      28   10
6    Lassie        Collie      30   15
7     Mangy          Mutt      40   10
8     Larry        Basset      25    4
9     Daryl     Retriever      42    8
10   Darrel     Chihuahua       9   48
11   Hotdog     Dachshund      14   14
12    Snert           Lab      40    4
13    Harpo      Airedale     200    9
14    Zeppo     Pekingese      32    5
15  Groucho       Whippet      49    7
16      Bob        Yorkie       8    1
17     Thor    Great Dane     105    6
18    Brian         Akita      65   12
19   Farkas         Boxer      52    9

In [51]:
#5. Download the file 'breeds.py' from Canvas; it contains a list of lists named 'breeds'. 
# Copy it into your interpreter; display breeds. No real work here â€“ just saving you some typing (you're welcome).
import breeds
print(breeds.breeds)

#6. Create a new table in dogdb named Breeds with the column names Breed, VARCHAR(20), and Description, VARCHAR(40). 
# Then insert the data from breeds in #5 into it.

cursor.execute('''CREATE TABLE Breeds (
                Breed VARCHAR(20),
                Description VARCHAR(40)
              )''')

[['Mutt', 'Mangy and skinny'], ['Boxer', 'Short, always looks grumpy'], ['Pekingese', 'Not really a dog'], ['Basset', 'So much skin'], ['Beagle', 'Cute-ish'], ['Irish_Setter', 'Drinks your whiskey'], ['Terrier', 'Fetch, boy'], ['Whippet', 'Whippet good'], ['Yorkie', 'Cute'], ['Gread Dane', 'So huuuge'], ['Akita', 'or is it Atika?'], ['Great Dane', 'Not that great']]

OperationalError: no such table: my_table

In [52]:
for row in breeds.breeds:
    cursor.execute('''INSERT INTO Breeds VALUES (?,?)''', row)
connection.commit()

In [53]:
#7. Query the table Breeds from dogdb and display it (i.e., as proof that it was stored).
query = 'select * from Breeds'
cursor.execute(query)
table = cursor.fetchall()
print(table)

[('Mutt', 'Mangy and skinny'), ('Boxer', 'Short, always looks grumpy'), ('Pekingese', 'Not really a dog'), ('Basset', 'So much skin'), ('Beagle', 'Cute-ish'), ('Irish_Setter', 'Drinks your whiskey'), ('Terrier', 'Fetch, boy'), ('Whippet', 'Whippet good'), ('Yorkie', 'Cute'), ('Gread Dane', 'So huuuge'), ('Akita', 'or is it Atika?'), ('Great Dane', 'Not that great')]

In [54]:
# 8. Write a JOIN query to join dogs with Breeds on the Breed field, but limited to the Name, Breed, and Description fields.

query = '''SELECT dogs.Name, dogs.Breed, Breeds.Description
            FROM dogs
            JOIN Breeds
            ON dogs.Breed = Breeds.Breed'''
cursor.execute(query)
table = cursor.fetchall()
print(table)

[('Fido', 'Mutt', 'Mangy and skinny'), ('Odie', 'Irish_Setter', 'Drinks your whiskey'), ('Snoopy', 'Beagle', 'Cute-ish'), ('Barfy', 'Mutt', 'Mangy and skinny'), ('Hugo', 'Terrier', 'Fetch, boy'), ('Mangy', 'Mutt', 'Mangy and skinny'), ('Larry', 'Basset', 'So much skin'), ('Zeppo', 'Pekingese', 'Not really a dog'), ('Groucho', 'Whippet', 'Whippet good'), ('Bob', 'Yorkie', 'Cute'), ('Thor', 'Great Dane', 'Not that great'), ('Brian', 'Akita', 'or is it Atika?'), ('Farkas', 'Boxer', 'Short, always looks grumpy')]

In [55]:
#9. Write a SELECT query to get dogs at least 5 years old. Display their names and ages only.
query = '''SELECT Name, Age
            FROM dogs
            WHERE Age >= 5'''
cursor.execute(query)
table = cursor.fetchall()
print(table)

[('Fido', 15), ('Barfy', 8), ('Spot', 12), ('Hugo', 10), ('Lassie', 15), ('Mangy', 10), ('Daryl', 8), ('Darrel', 48), ('Hotdog', 14), ('Harpo', 9), ('Zeppo', 5), ('Groucho', 7), ('Thor', 6), ('Brian', 12), ('Farkas', 9)]

In [56]:
# 10. Write a SELECT query to get the average age (use AVG(dogs.Age) ) 
# display it in a formatted Python statement with a label and 2 decimal places.

query = '''SELECT AVG(Age)
            FROM dogs'''
cursor.execute(query)
table = cursor.fetchall()
print(table)
print('The average age of the dogs is {:.2f}'.format(table[0][0]))

[(10.05,)]
The average age of the dogs is 10.05